In [2]:
import pandas as pd


# create practice dictionary

pract = {'name' : ["John","Jacob","Jingle","Heimer","Schmidt","Polly","Pattern"],
         'age' : [22,33,44,45,52,36,7],
         'grade' : [99,98,91,87,83,99,7],
         'gender' : ["M","M","M","M","M","F","M"]}

In [3]:
df1 = pd.DataFrame(pract)

In [4]:
df1.head()

      name  age  grade gender
0     John   22     99      M
1    Jacob   33     98      M
2   Jingle   44     91      M
3   Heimer   45     87      M
4  Schmidt   52     83      M

In [5]:
#Display top 3 rows of a dataset
df1.head(3)

     name  age  grade gender
0    John   22     99      M
1   Jacob   33     98      M
2  Jingle   44     91      M

In [6]:
#Display last 3 rows of a dataset

df1.tail(3)

      name  age  grade gender
4  Schmidt   52     83      M
5    Polly   36     99      F
6  Pattern    7      7      M

In [7]:
# remove index

df1.reset_index()

   index     name  age  grade gender
0      0     John   22     99      M
1      1    Jacob   33     98      M
2      2   Jingle   44     91      M
3      3   Heimer   45     87      M
4      4  Schmidt   52     83      M
5      5    Polly   36     99      F
6      6  Pattern    7      7      M

In [8]:
df1.reset_index(drop = True)

      name  age  grade gender
0     John   22     99      M
1    Jacob   33     98      M
2   Jingle   44     91      M
3   Heimer   45     87      M
4  Schmidt   52     83      M
5    Polly   36     99      F
6  Pattern    7      7      M

In [9]:
#Find dataframe shape i.e. number of rows and columns in the dataframe

df1.shape

(7, 4)

In [10]:
#print the number of rows


print('number of rows', df1.shape[0])

number of rows 7

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    7 non-null      object
 1   age     7 non-null      int64
 2   grade   7 non-null      int64
 3   gender  7 non-null      object
dtypes: int64(2), object(2)
memory usage: 356.0+ bytes

In [12]:
#Checking for null rows vs null columns

#null columns

df1.isnull().sum(axis = 0)

name      0
age       0
grade     0
gender    0
dtype: int64

In [13]:
#null rows
df1.isnull().sum(axis = 1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [14]:
#overall statistics about the dataframe
# by default describe only shows stats for numerical columns
df1.describe()

             age      grade
count   7.000000   7.000000
mean   34.142857  80.571429
std    15.399443  33.044703
min     7.000000   7.000000
25%    27.500000  85.000000
50%    36.000000  91.000000
75%    44.500000  98.500000
max    52.000000  99.000000

In [15]:
df1.describe(include="all")

        name        age      grade gender
count      7   7.000000   7.000000      7
unique     7        NaN        NaN      2
top     John        NaN        NaN      M
freq       1        NaN        NaN      6
mean     NaN  34.142857  80.571429    NaN
std      NaN  15.399443  33.044703    NaN
min      NaN   7.000000   7.000000    NaN
25%      NaN  27.500000  85.000000    NaN
50%      NaN  36.000000  91.000000    NaN
75%      NaN  44.500000  98.500000    NaN
max      NaN  52.000000  99.000000    NaN

In [16]:
#Finding unique values
df1["gender"].unique()

array(['M', 'F'], dtype=object)

In [17]:
#Find number of unique values
df1["gender"].nunique()

2

In [18]:
#find total number of students with a grade above 90

df1["grade"] >= 90

0     True
1     True
2     True
3    False
4    False
5     True
6    False
Name: grade, dtype: bool

In [19]:
#Return the dataframe with only the students who got above a 90
df1[df1["grade"]>=90]

     name  age  grade gender
0    John   22     99      M
1   Jacob   33     98      M
2  Jingle   44     91      M
5   Polly   36     99      F

In [20]:
# find the count of students who have a grade between 90 and a 100
# can use len function
len(df1[df1["grade"]>=90])

4

In [21]:
#can use sum method

sum(df1["grade"]>=90)

4

In [22]:
# apply method

def marks(x) :
    return x/2

In [23]:
marks(100)

50.0

In [25]:
# using map to encode to numbers

df1["gender"].map({"M" : 1, "F" : 2})

0    1
1    1
2    1
3    1
4    1
5    2
6    1
Name: gender, dtype: int64

In [28]:
df1["male_female"] = df1["gender"].map({"M" : 1, "F" : 2})

In [30]:
df1.head(10)

      name  age  grade gender  male_female
0     John   22     99      M            1
1    Jacob   33     98      M            1
2   Jingle   44     91      M            1
3   Heimer   45     87      M            1
4  Schmidt   52     83      M            1
5    Polly   36     99      F            2
6  Pattern    7      7      M            1

In [32]:
#drop male_female column

df1.drop("male_female", axis = 1)

      name  age  grade gender
0     John   22     99      M
1    Jacob   33     98      M
2   Jingle   44     91      M
3   Heimer   45     87      M
4  Schmidt   52     83      M
5    Polly   36     99      F
6  Pattern    7      7      M

In [35]:
#drop pattern's data, use the row index

df1.drop(6)

      name  age  grade gender  male_female
0     John   22     99      M            1
1    Jacob   33     98      M            1
2   Jingle   44     91      M            1
3   Heimer   45     87      M            1
4  Schmidt   52     83      M            1
5    Polly   36     99      F            2

In [38]:
#sort grades highest to lowest

df1.sort_values(by = "grade", ascending = False)

      name  age  grade gender  male_female
0     John   22     99      M            1
5    Polly   36     99      F            2
1    Jacob   33     98      M            1
2   Jingle   44     91      M            1
3   Heimer   45     87      M            1
4  Schmidt   52     83      M            1
6  Pattern    7      7      M            1

In [40]:
pd.sort_values.__doc__

AttributeError: module 'pandas' has no attribute 'sort_values'

In [41]:
#display only female 

df1[df1["gender"] == "F"]

    name  age  grade gender  male_female
5  Polly   36     99      F            2

In [44]:
# display only the name and age column for gender = F

df1[df1["gender"] == "F"][["name","age"]]

    name  age
5  Polly   36